tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1776_tdd.h
#define RG1INS3                       2765
#define PRG1CON0                      2766
#define PRG1CON0_GO                   2767
#define RG1GO                         2768
#define RG1OS                         2769
#define PRG1CON0_OS                   2770
#define RG1MODE0                      2771
#define RG1MODE                       2772
#define PRG1CON0_MODE                 2773
#define PRG1CON0_MODE0                2774
#define RG1MODE1                      2775
#define PRG1CON0_MODE1                2776
#define PRG1CON0_REDG                 2777
#define RG1REDG                       2778
#define RG1FEDG                       2779
#define PRG1CON0_FEDG                 2780
#define PRG1CON0_EN                   2781
#define RG1EN                         2782
#define PRG1CON1                      2783
#define PRG1CON1_RPOL                 2784
#define RG1RPOL                       2785
#define PRG1CON1_FPOL                 2786
#define RG1FPOL                       2787
#define PRG1CON1_RDY                  2788
#define RG1RDY                        2789
#define PRG1CON2                      2790
#define RG1ISET0                      2791
#define PRG1CON2_ISET                 2792
#define RG1ISET                       2793
#define PRG1CON2_ISET0                2794
#define RG1ISET1                      2795
#define PRG1CON2_ISET1                2796
#define RG1ISET2                      2797
#define PRG1CON2_ISET2                2798
#define RG1ISET3                      2799
#define PRG1CON2_ISET3                2800
#define RG1ISET4                      2801
#define PRG1CON2_ISET4                2802
#define PRG2RTSS                      2803
#define PRG2RTSS_RTSS                 2804
#define RG2RTSS0                      2805
#define PRG2RTSS_RTSS0                2806
#define RG2RTSS1                      2807
#define PRG2RTSS_RTSS1                2808
#define RG2RTSS2                      2809
#define PRG2RTSS_RTSS2                2810
#define RG2RTSS3                      2811
#define PRG2RTSS_RTSS3                2812
#define PRG2FTSS                      2813
#define RG2FTSS0                      2814
#define PRG2FTSS_FTSS                 2815
#define PRG2FTSS_FTSS0                2816
#define RG2FTSS1                      2817
#define PRG2FTSS_FTSS1                2818
#define PRG2FTSS_FTSS2                2819
#define RG2FTSS2                      2820
#define RG2FTSS3                      2821
#define PRG2FTSS_FTSS3                2822
#define PRG2INS                       2823
#define PRG2INS_INS                   2824
#define PRG2INS_INS0                  2825
#define RG2INS0                       2826
#define PRG2INS_INS1                  2827
#define RG2INS1                       2828
#define PRG2INS_INS2                  2829
#define RG2INS2                       2830
#define PRG2INS_INS3                  2831
#define RG2INS3                       2832
#define PRG2CON0                      2833
#define PRG2CON0_GO                   2834
#define RG2GO                         2835
#define PRG2CON0_OS                   2836
#define RG2OS                         2837
#define RG2MODE0                      2838
#define PRG2CON0_MODE0                2839
#define RG2MODE                       2840
#define PRG2CON0_MODE                 2841
#define RG2MODE1                      2842
#define PRG2CON0_MODE1                2843
#define PRG2CON0_REDG                 2844
#define RG2REDG                       2845
#define RG2FEDG                       2846
#define PRG2CON0_FEDG                 2847
#define PRG2CON0_EN                   2848
#define RG2EN                         2849
#define PRG2CON1                      2850
#define PRG2CON1_RPOL                 2851
#define RG2RPOL                       2852
#define PRG2CON1_FPOL                 2853
#define RG2FPOL                       2854
#define PRG2CON1_RDY                  2855
#define RG2RDY                        2856
#define PRG2CON2                      2857
#define PRG2CON2_ISET                 2858
#define RG2ISET0                      2859
#define PRG2CON2_ISET0                2860
#define RG2ISET                       2861
#define RG2ISET1                      2862
#define PRG2CON2_ISET1                2863
#define RG2ISET2                      2864
#define PRG2CON2_ISET2                2865
#define RG2ISET3                      2866
#define PRG2CON2_ISET3                2867
#define PRG2CON2_ISET4                2868
#define RG2ISET4                      2869
#define PRG3RTSS                      2870
#define PRG3RTSS_RTSS0                2871
#define PRG3RTSS_RTSS                 2872
#define RG3RTSS0                      2873
#define PRG3RTSS_RTSS1                2874
#define RG3RTSS1                      2875
#define PRG3RTSS_RTSS2                2876
#define RG3RTSS2                      2877
#define PRG3RTSS_RTSS3                2878
#define RG3RTSS3                      2879
#define PRG3FTSS                      2880
#define PRG3FTSS_FTSS0                2881
#define RG3FTSS0                      2882
#define PRG3FTSS_FTSS                 2883
#define RG3FTSS1                      2884
#define PRG3FTSS_FTSS1                2885
#define RG3FTSS2                      2886
#define PRG3FTSS_FTSS2                2887
#define RG3FTSS3                      2888
#define PRG3FTSS_FTSS3                2889
#define PRG3INS                       2890
#define RG3INS0                       2891
#define PRG3INS_INS0                  2892
#define PRG3INS_INS                   2893
#define RG3INS1                       2894
#define PRG3INS_INS1                  2895
#define PRG3INS_INS2                  2896
#define RG3INS2                       2897
#define RG3INS3                       2898
#define PRG3INS_INS3                  2899
#define PRG3CON0                      2900
#define PRG3CON0_GO                   2901
#define RG3GO                         2902
#define RG3OS                         2903
#define PRG3CON0_OS                   2904
#define PRG3CON0_MODE                 2905
#define RG3MODE                       2906
#define PRG3CON0_MODE0                2907
#define RG3MODE0                      2908
#define PRG3CON0_MODE1                2909
#define RG3MODE1                      2910
#define PRG3CON0_REDG                 2911
#define RG3REDG                       2912
#define PRG3CON0_FEDG                 2913
#define RG3FEDG                       2914
#define PRG3CON0_EN                   2915
#define RG3EN                         2916
#define PRG3CON1                      2917
#define PRG3CON1_RPOL                 2918
#define RG3RPOL                       2919
#define RG3FPOL                       2920
#define PRG3CON1_FPOL                 2921
#define PRG3CON1_RDY                  2922
#define RG3RDY                        2923
#define PRG3CON2                      2924
#define PRG3CON2_ISET                 2925
#define RG3ISET                       2926
#define RG3ISET0                      2927
#define PRG3CON2_ISET0                2928
#define PRG3CON2_ISET1                2929
#define RG3ISET1                      2930
#define RG3ISET2                      2931
#define PRG3CON2_ISET2                2932
#define RG3ISET3                      2933
#define PRG3CON2_ISET3                2934
#define PRG3CON2_ISET4                2935
#define RG3ISET4                      2936
#define COG3PHR                       2937
#define COG3PHR_PHR0                  2938
#define G3PHR0                        2939
#define COG3PHR_PHR                   2940
#define G3PHR1                        2941
#define COG3PHR_PHR1                  2942
#define COG3PHR_PHR2                  2943
#define G3PHR2                        2944
#define COG3PHR_PHR3                  2945
#define G3PHR3                        2946
#define COG3PHR_PHR4                  2947
#define G3PHR4                        2948
#define G3PHR5                        2949
#define COG3PHR_PHR5                  2950
#define COG3PHF                       2951
#define COG3PHF_PHF                   2952
#define G3PHF0                        2953
#define COG3PHF_PHF0                  2954
#define COG3PHF_PHF1                  2955
#define G3PHF1                        2956
#define COG3PHF_PHF2                  2957
#define G3PHF2                        2958
#define COG3PHF_PHF3                  2959
#define G3PHF3                        2960
#define COG3PHF_PHF4                  2961
#define G3PHF4                        2962
#define COG3PHF_PHF5                  2963
#define G3PHF5                        2964
#define COG3BLKR                      2965
#define COG3BLKR_BLKR0                2966
#define G3BLKR0                       2967
#define COG3BLKR_BLKR                 2968
#define COG3BLKR_BLKR1                2969
#define G3BLKR1                       2970
#define COG3BLKR_BLKR2                2971
#define G3BLKR2                       2972
#define COG3BLKR_BLKR3                2973
#define G3BLKR3                       2974
#define COG3BLKR_BLKR4                2975
#define G3BLKR4                       2976
#define COG3BLKR_BLKR5                2977
#define G3BLKR5                       2978
#define COG3BLKF                      2979
#define G3BLKF0                       2980
#define COG3BLKF_BLKF                 2981
#define COG3BLKF_BLKF0                2982
#define G3BLKF1                       2983
#define COG3BLKF_BLKF1                2984
#define G3BLKF2                       2985
#define COG3BLKF_BLKF2                2986
#define G3BLKF3                       2987
#define COG3BLKF_BLKF3                2988
#define G3BLKF4                       2989
#define COG3BLKF_BLKF4                2990
#define G3BLKF5                       2991
#define COG3BLKF_BLKF5                2992
#define COG3DBR                       2993
#define G3DBR0                        2994
#define COG3DBR_DBR0                  2995
#define COG3DBR_DBR                   2996
#define G3DBR1                        2997
#define COG3DBR_DBR1                  2998
#define G3DBR2                        2999
#define COG3DBR_DBR2                  3000
#define G3DBR3                        3001
#define COG3DBR_DBR3                  3002
#define G3DBR4                        3003
#define COG3DBR_DBR4                  3004
#define G3DBR5                        3005
#define COG3DBR_DBR5                  3006
#define COG3DBF                       3007
#define G3DBF                         3008
#define G3DBF0                        3009
#define COG3DBF_DBF0                  3010
#define G3DBF1                        3011
#define COG3DBF_DBF1                  3012
#define G3DBF2                        3013
#define COG3DBF_DBF2                  3014
#define G3DBF3                        3015
#define COG3DBF_DBF3                  3016
#define G3DBF4                        3017
#define COG3DBF_DBF4                  3018
#define G3DBF5                        3019
#define COG3DBF_DBF5                  3020
#define COG3CON0                      3021
#define G3MD                          3022
#define COG3CON0_MD                   3023
#define G3MD0                         3024
#define COG3CON0_MD0                  3025
#define G3MD1                         3026
#define COG3CON0_MD1                  3027
#define COG3CON0_MD2                  3028
#define G3MD2                         3029
#define G3CS                          3030
#define COG3CON0_CS0                  3031
#define G3CS0                         3032
#define COG3CON0_CS                   3033
#define COG3CON0_CS1                  3034
#define G3CS1                         3035
#define COG3CON0_LD                   3036
#define G3LD                          3037
#define G3EN                          3038
#define COG3CON0_EN                   3039
#define COG3CON1                      3040
#define G3POLA                        3041
#define COG3CON1_POLA                 3042
#define G3POLB                        3043
#define COG3CON1_POLB                 3044
#define G3POLC                        3045
#define COG3CON1_POLC                 3046
#define COG3CON1_POLD                 3047
#define G3POLD                        3048
#define G3FDBS                        3049
#define COG3CON1_FDBS                 3050
#define COG3CON1_RDBS                 3051
#define G3RDBS                        3052
#define COG3RIS0                      3053
#define G3RIS0                        3054
#define COG3RIS0_RIS0                 3055
#define G3RIS1                        3056
#define COG3RIS0_RIS1                 3057
#define G3RIS2                        3058
#define COG3RIS0_RIS2                 3059
#define G3RIS3                        3060
#define COG3RIS0_RIS3                 3061
#define G3RIS4                        3062
#define COG3RIS0_RIS4                 3063
#define G3RIS5                        3064
#define COG3RIS0_RIS5                 3065
#define G3RIS6                        3066
#define COG3RIS0_RIS6                 3067
#define G3RIS7                        3068
#define COG3RIS0_RIS7                 3069
#define COG3RIS1                      3070
#define G3RIS9                        3071
#define COG3RIS1_RIS9                 3072
#define G3RIS11                       3073
#define COG3RIS1_RIS11                3074
#define G3RIS12                       3075
#define COG3RIS1_RIS12                3076
#define G3RIS13                       3077
#define COG3RIS1_RIS13                3078
#define G3RIS14                       3079
#define COG3RIS1_RIS14                3080
#define G3RIS15                       3081
#define COG3RIS1_RIS15                3082
#define COG3RSIM0                     3083
#define G3RSIM0                       3084
#define COG3RSIM0_RSIM0               3085
#define G3RSIM1                       3086
#define COG3RSIM0_RSIM1               3087
#define G3RSIM2                       3088
#define COG3RSIM0_RSIM2               3089
#define G3RSIM3                       3090
#define COG3RSIM0_RSIM3               3091
#define G3RSIM4                       3092
#define COG3RSIM0_RSIM4               3093
#define G3RSIM5                       3094
#define COG3RSIM0_RSIM5               3095
#define G3RSIM6                       3096
#define COG3RSIM0_RSIM6               3097
#define G3RSIM7                       3098
#define COG3RSIM0_RSIM7               3099
#define COG3RSIM1                     3100
#define G3RSIM9                       3101
#define COG3RSIM1_RSIM9               3102
#define G3RSIM11                      3103
#define COG3RSIM1_RSIM11              3104
#define G3RSIM12                      3105
#define COG3RSIM1_RSIM12              3106
#define G3RSIM13                      3107
#define COG3RSIM1_RSIM13              3108
#define G3RSIM14                      3109
#define COG3RSIM1_RSIM14              3110
#define G3RSIM15                      3111
#define COG3RSIM1_RSIM15              3112
#define COG3FIS0                      3113
#define COG3FIS0_FIS0                 3114
#define G3FIS0                        3115
#define COG3FIS0_FIS1                 3116
#define G3FIS1                        3117
#define COG3FIS0_FIS2                 3118
#define G3FIS2                        3119
#define COG3FIS0_FIS3                 3120
#define G3FIS3                        3121
#define COG3FIS0_FIS4                 3122
#define G3FIS4                        3123
#define COG3FIS0_FIS5                 3124
#define G3FIS5                        3125
#define COG3FIS0_FIS6                 3126
#define G3FIS6                        3127
#define G3FIS7                        3128
#define COG3FIS0_FIS7                 3129
#define COG3FIS1                      3130
#define G3FIS9                        3131
#define COG3FIS1_FIS9                 3132
#define COG3FIS1_FIS11                3133
#define G3FIS11                       3134
#define G3FIS12                       3135
#define COG3FIS1_FIS12                3136
#define G3FIS13                       3137
#define COG3FIS1_FIS13                3138
#define G3FIS14                       3139
#define COG3FIS1_FIS14                3140
#define G3FIS15                       3141
#define COG3FIS1_FIS15                3142
#define COG3FSIM0                     3143
#define COG3FSIM0_FSIM0               3144
#define G3FSIM0                       3145
#define G3FSIM1                       3146
#define COG3FSIM0_FSIM1               3147
#define COG3FSIM0_FSIM2               3148
#define G3FSIM2                       3149
#define COG3FSIM0_FSIM3               3150
#define G3FSIM3                       3151
#define G3FSIM4                       3152
#define COG3FSIM0_FSIM4               3153
#define COG3FSIM0_FSIM5               3154
#define G3FSIM5                       3155
#define COG3FSIM0_FSIM6               3156
#define G3FSIM6                       3157
#define COG3FSIM0_FSIM7               3158
#define G3FSIM7                       3159
#define COG3FSIM1                     3160
#define COG3FSIM1_FSIM9               3161
#define G3FSIM9                       3162
#define COG3FSIM1_FSIM11              3163
#define G3FSIM11                      3164
#define G3FSIM12                      3165
#define COG3FSIM1_FSIM12              3166
#define COG3FSIM1_FSIM13              3167
#define G3FSIM13                      3168
#define G3FSIM14                      3169
#define COG3FSIM1_FSIM14              3170
#define G3FSIM15                      3171
#define COG3FSIM1_FSIM15              3172
#define COG3ASD0                      3173
#define COG3ASD0_ASDAC0               3174
#define G3ASDAC                       3175
#define G3ASDAC0                      3176
#define COG3ASD0_ASDAC                3177
#define COG3ASD0_ASDAC1               3178
#define G3ASDAC1                      3179
#define G3ASDBD                       3180
#define COG3ASD0_ASDBD                3181
#define G3ASDBD0                      3182
#define COG3ASD0_ASDBD0               3183
#define COG3ASD0_ASDBD1               3184
#define G3ASDBD1                      3185
#define COG3ASD0_ASREN                3186
#define COG3ASD0_ARSEN                3187
#define G3ASREN                       3188
#define G3ARSEN                       3189
#define COG3ASD0_ASE                  3190
#define G3ASE                         3191
#define COG3ASD1                      3192
#define G3AS0E                        3193
#define COG3ASD1_AS0E                 3194
#define G3AS1E                        3195
#define COG3ASD1_AS1E                 3196
#define COG3ASD1_AS2E                 3197
#define G3AS2E                        3198
#define G3AS3E                        3199
#define COG3ASD1_AS3E                 3200
#define G3AS4E                        3201
#define COG3ASD1_AS4E                 3202
#define G3AS5E                        3203
#define COG3ASD1_AS5E                 3204
#define G3AS6E                        3205
#define COG3ASD1_AS6E                 3206
#define COG3ASD1_AS7E                 3207
#define G3AS7E                        3208
#define COG3STR                       3209
#define COG3STR_STRA                  3210
#define G3STRA                        3211
#define COG3STR_STRB                  3212
#define G3STRB                        3213
#define COG3STR_STRC                  3214
#define G3STRC                        3215
#define COG3STR_STRD                  3216
#define G3STRD                        3217
#define COG3STR_SDATA                 3218
#define G3SDATA                       3219
#define COG3STR_SDATB                 3220
#define G3SDATB                       3221
#define COG3STR_SDATC                 3222
#define G3SDATC                       3223
#define COG3STR_SDATD                 3224
#define G3SDATD                       3225
#define CM4CON0                       3226
#define CM4CON0_SYNC                  3227
#define C4SYNC                        3228
#define C4HYS                         3229
#define CM4CON0_HYS                   3230
#define C4SP                          3231
#define C4ZLF                         3232
#define CM4CON0_ZLF                   3233
#define C4POL                         3234
#define CM4CON0_POL                   3235
#define C4OUT                         3236
#define CM4CON0_OUT                   3237
#define C4ON                          3238
#define CM4CON0_ON                    3239
#define CM4CON1                       3240
#define C4INTN                        3241
#define CM4CON1_INTN                  3242
#define CM4CON1_INTP                  3243
#define C4INTP                        3244
#define CM4NSEL                       3245
#define CM4NSEL_NCH                   3246
#define C4NCH0                        3247
#define C4NCH                         3248
#define C4NCH1                        3249
#define C4NCH2                        3250
#define C4NCH3                        3251
#define CM4PSEL                       3252
#define CM4PSEL_PCH0                  3253
#define C4PCH0                        3254
#define C4PCH                         3255
#define CM4PSEL_PCH                   3256
#define CM4PSEL_PCH1                  3257
#define C4PCH1                        3258
#define CM4PSEL_PCH2                  3259
#define C4PCH2                        3260
#define CM4PSEL_PCH3                  3261
#define C4PCH3                        3262
#define CM5CON0                       3263
#define CM5CON0_SYNC                  3264
#define C5SYNC                        3265
#define C5HYS                         3266
#define CM5CON0_HYS                   3267
#define C5SP                          3268
#define CM5CON0_ZLF                   3269
#define C5ZLF                         3270
#define C5POL                         3271
#define CM5CON0_POL                   3272
#define CM5CON0_OUT                   3273
#define C5OUT                         3274
#define CM5CON0_ON                    3275
#define C5ON                          3276
#define CM5CON1                       3277
#define CM5CON1_INTN                  3278
#define C5INTN                        3279
#define CM5CON1_INTP                  3280
#define C5INTP                        3281
#define CM5NSEL                       3282
#define C5NCH                         3283
#define CM5NSEL_NCH                   3284
#define C5NCH0                        3285
#define C5NCH1                        3286
#define C5NCH2                        3287
#define C5NCH3                        3288
#define CM5PSEL                       3289
#define C5PCH                         3290
#define CM5PSEL_PCH                   3291
#define C5PCH0                        3292
#define CM5PSEL_PCH0                  3293
#define C5PCH1                        3294
#define CM5PSEL_PCH1                  3295
#define C5PCH2                        3296
#define CM5PSEL_PCH2                  3297
#define C5PCH3                        3298
#define CM5PSEL_PCH3                  3299
#define CM6CON0                       3300
#define C6SYNC                        3301
#define CM6CON0_SYNC                  3302
#define C6HYS                         3303
#define CM6CON0_HYS                   3304
#define C6SP                          3305
#define CM6CON0_ZLF                   3306
#define C6ZLF                         3307
#define CM6CON0_POL                   3308
#define C6POL                         3309
#define C6OUT                         3310
#define CM6CON0_OUT                   3311
#define CM6CON0_ON                    3312
#define C6ON                          3313
#define CM6CON1                       3314
#define C6INTN                        3315
#define CM6CON1_INTN                  3316
#define CM6CON1_INTP                  3317
#define C6INTP                        3318
#define CM6NSEL                       3319
#define C6NCH                         3320
#define C6NCH0                        3321
#define CM6NSEL_NCH                   3322
