tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1776_tdd.h
#define T2INPPS                       3881
#define T4INPPS                       3882
#define T6INPPS                       3883
#define T8INPPS                       3884
#define CCP1PPS                       3885
#define CCP2PPS                       3886
#define CCP7PPS                       3887
#define COG1INPPS                     3888
#define COG2INPPS                     3889
#define COG3INPPS                     3890
#define MD1CLPPS                      3891
#define MD1CHPPS                      3892
#define MD1MODPPS                     3893
#define MD2CLPPS                      3894
#define MD2CHPPS                      3895
#define MD2MODPPS                     3896
#define MD3CLPPS                      3897
#define MD3CHPPS                      3898
#define MD3MODPPS                     3899
#define PRG1RPPS                      3900
#define PRG1FPPS                      3901
#define PRG2RPPS                      3902
#define PRG2FPPS                      3903
#define PRG3RPPS                      3904
#define PRG3FPPS                      3905
#define CLCIN0PPS                     3906
#define CLCIN1PPS                     3907
#define CLCIN2PPS                     3908
#define CLCIN3PPS                     3909
#define ADCACTPPS                     3910
#define SSPCLKPPS                     3911
#define SSPDATPPS                     3912
#define SSPSSPPS                      3913
#define RXPPS                         3914
#define CKPPS                         3915
#define RA0PPS                        3916
#define RA1PPS                        3917
#define RA2PPS                        3918
#define RA3PPS                        3919
#define RA4PPS                        3920
#define RA5PPS                        3921
#define RA6PPS                        3922
#define RA7PPS                        3923
#define RB0PPS                        3924
#define RB1PPS                        3925
#define RB2PPS                        3926
#define RB3PPS                        3927
#define RB4PPS                        3928
#define RB5PPS                        3929
#define RB6PPS                        3930
#define RB7PPS                        3931
#define RC0PPS                        3932
#define RC1PPS                        3933
#define RC2PPS                        3934
#define RC3PPS                        3935
#define RC4PPS                        3936
#define RC5PPS                        3937
#define RC6PPS                        3938
#define RC7PPS                        3939
#define CLCDATA                       3940
#define MCLC1OUT                      3941
#define MCLC2OUT                      3942
#define MCLC3OUT                      3943
#define MLC4OUT                       3944
#define CLC1CON                       3945
#define CLC1CON_MODE                  3946
#define LC1MODE0                      3947
#define LC1MODE                       3948
#define CLC1CON_MODE0                 3949
#define LC1MODE1                      3950
#define CLC1CON_MODE1                 3951
#define CLC1CON_MODE2                 3952
#define LC1MODE2                      3953
#define LC1INTN                       3954
#define CLC1CON_INTN                  3955
#define LC1INTP                       3956
#define CLC1CON_INTP                  3957
#define CLC1CON_OUT                   3958
#define LC1OUT                        3959
#define LC1EN                         3960
#define CLC1CON_EN                    3961
#define CLC1POL                       3962
#define LC1G1POL                      3963
#define CLC1POL_G1POL                 3964
#define CLC1POL_G2POL                 3965
#define LC1G2POL                      3966
#define LC1G3POL                      3967
#define CLC1POL_G3POL                 3968
#define LC1G4POL                      3969
#define CLC1POL_G4POL                 3970
#define CLC1POL_POL                   3971
#define LC1POL                        3972
#define CLC1SEL0                      3973
#define CLC1SEL0_D1S0                 3974
#define LC1D1S0                       3975
#define CLC1SEL0_D1S                  3976
#define LC1D1S                        3977
#define CLC1SEL0_D1S1                 3978
#define LC1D1S1                       3979
#define CLC1SEL0_D1S2                 3980
#define LC1D1S2                       3981
#define LC1D1S3                       3982
#define CLC1SEL0_D1S3                 3983
#define CLC1SEL0_D1S4                 3984
#define LC1D1S4                       3985
#define CLC1SEL0_D1S5                 3986
#define LC1D1S5                       3987
#define CLC1SEL1                      3988
#define CLC1SEL1_D2S0                 3989
#define CLC1SEL1_D2S                  3990
#define LC1D2S                        3991
#define LC1D2S0                       3992
#define CLC1SEL1_D2S1                 3993
#define LC1D2S1                       3994
#define CLC1SEL1_D2S2                 3995
#define LC1D2S2                       3996
#define LC1D2S3                       3997
#define CLC1SEL1_D2S3                 3998
#define LC1D2S4                       3999
#define CLC1SEL1_D2S4                 4000
#define LC1D2S5                       4001
#define CLC1SEL1_D2S5                 4002
#define CLC1SEL2                      4003
#define LC1D3S0                       4004
#define CLC1SEL2_D3S                  4005
#define LC1D3S                        4006
#define CLC1SEL2_D3S0                 4007
#define LC1D3S1                       4008
#define CLC1SEL2_D3S1                 4009
#define LC1D3S2                       4010
#define CLC1SEL2_D3S2                 4011
#define LC1D3S3                       4012
#define CLC1SEL2_D3S3                 4013
#define LC1D3S4                       4014
#define CLC1SEL2_D3S4                 4015
#define LC1D3S5                       4016
#define CLC1SEL2_D3S5                 4017
#define CLC1SEL3                      4018
#define CLC1SEL3_D4S                  4019
#define LC1D4S                        4020
#define LC1D4S0                       4021
#define CLC1SEL3_D4S0                 4022
#define CLC1SEL3_D4S1                 4023
#define LC1D4S1                       4024
#define LC1D4S2                       4025
#define CLC1SEL3_D4S2                 4026
#define LC1D4S3                       4027
#define CLC1SEL3_D4S3                 4028
#define LC1D4S4                       4029
#define CLC1SEL3_D4S4                 4030
#define LC1D4S5                       4031
#define CLC1SEL3_D4S5                 4032
#define CLC1GLS0                      4033
#define CLC1GLS0_D1N                  4034
#define LC1G1D1N                      4035
#define CLC1GLS0_D1T                  4036
#define LC1G1D1T                      4037
#define LC1G1D2N                      4038
#define CLC1GLS0_D2N                  4039
#define LC1G1D2T                      4040
#define CLC1GLS0_D2T                  4041
#define CLC1GLS0_D3N                  4042
#define LC1G1D3N                      4043
#define CLC1GLS0_D3T                  4044
#define LC1G1D3T                      4045
#define CLC1GLS0_D4N                  4046
#define LC1G1D4N                      4047
#define CLC1GLS0_D4T                  4048
#define LC1G1D4T                      4049
#define CLC1GLS1                      4050
#define CLC1GLS1_D1N                  4051
#define LC1G2D1N                      4052
#define LC1G2D1T                      4053
#define CLC1GLS1_D1T                  4054
#define CLC1GLS1_D2N                  4055
#define LC1G2D2N                      4056
#define LC1G2D2T                      4057
#define CLC1GLS1_D2T                  4058
#define CLC1GLS1_D3N                  4059
#define LC1G2D3N                      4060
#define LC1G2D3T                      4061
#define CLC1GLS1_D3T                  4062
#define CLC1GLS1_D4N                  4063
#define LC1G2D4N                      4064
#define LC1G2D4T                      4065
#define CLC1GLS1_D4T                  4066
#define CLC1GLS2                      4067
#define CLC1GLS2_D1N                  4068
#define LC1G3D1N                      4069
#define LC1G3D1T                      4070
#define CLC1GLS2_D1T                  4071
#define LC1G3D2N                      4072
#define CLC1GLS2_D2N                  4073
#define LC1G3D2T                      4074
#define CLC1GLS2_D2T                  4075
#define CLC1GLS2_D3N                  4076
#define LC1G3D3N                      4077
#define LC1G3D3T                      4078
#define CLC1GLS2_D3T                  4079
#define LC1G3D4N                      4080
#define CLC1GLS2_D4N                  4081
#define LC1G3D4T                      4082
#define CLC1GLS2_D4T                  4083
#define CLC1GLS3                      4084
#define LC1G4D1N                      4085
#define CLC1GLS3_G4D1N                4086
#define LC1G4D1T                      4087
#define CLC1GLS3_G4D1T                4088
#define CLC1GLS3_G4D2N                4089
#define LC1G4D2N                      4090
#define CLC1GLS3_G4D2T                4091
#define LC1G4D2T                      4092
#define LC1G4D3N                      4093
#define CLC1GLS3_G4D3N                4094
#define LC1G4D3T                      4095
#define CLC1GLS3_G4D3T                4096
#define CLC1GLS3_G4D4N                4097
#define LC1G4D4N                      4098
#define CLC1GLS3_G4D4T                4099
#define LC1G4D4T                      4100
#define CLC2CON                       4101
#define LC2MODE0                      4102
#define CLC2CON_MODE                  4103
#define LC2MODE                       4104
#define CLC2CON_MODE0                 4105
#define LC2MODE1                      4106
#define CLC2CON_MODE1                 4107
#define LC2MODE2                      4108
#define CLC2CON_MODE2                 4109
#define LC2INTN                       4110
#define CLC2CON_INTN                  4111
#define LC2INTP                       4112
#define CLC2CON_INTP                  4113
#define CLC2CON_OUT                   4114
#define LC2OUT                        4115
#define CLC2CON_EN                    4116
#define LC2EN                         4117
#define CLC2POL                       4118
#define LC2G1POL                      4119
#define CLC2POL_G1POL                 4120
#define LC2G2POL                      4121
#define CLC2POL_G2POL                 4122
#define LC2G3POL                      4123
#define CLC2POL_G3POL                 4124
#define LC2G4POL                      4125
#define CLC2POL_G4POL                 4126
#define CLC2POL_POL                   4127
#define LC2POL                        4128
#define CLC2SEL0                      4129
#define CLC2SEL0_D1S                  4130
#define LC2D1S0                       4131
#define CLC2SEL0_D1S0                 4132
#define LC2D1S                        4133
#define LC2D1S1                       4134
#define CLC2SEL0_D1S1                 4135
#define LC2D1S2                       4136
#define CLC2SEL0_D1S2                 4137
#define CLC2SEL0_D1S3                 4138
#define LC2D1S3                       4139
#define LC2D1S4                       4140
#define CLC2SEL0_D1S4                 4141
#define LC2D1S5                       4142
#define CLC2SEL0_D1S5                 4143
#define CLC2SEL1                      4144
#define LC2D2S0                       4145
#define CLC2SEL1_D2S0                 4146
#define LC2D2S                        4147
#define CLC2SEL1_D2S                  4148
#define LC2D2S1                       4149
#define CLC2SEL1_D2S1                 4150
#define LC2D2S2                       4151
#define CLC2SEL1_D2S2                 4152
#define LC2D2S3                       4153
#define CLC2SEL1_D2S3                 4154
#define LC2D2S4                       4155
#define CLC2SEL1_D2S4                 4156
#define LC2D2S5                       4157
#define CLC2SEL1_D2S5                 4158
#define CLC2SEL2                      4159
#define CLC2SEL2_D3S                  4160
#define LC2D3S0                       4161
#define CLC2SEL2_D3S0                 4162
#define LC2D3S                        4163
#define CLC2SEL2_D3S1                 4164
#define LC2D3S1                       4165
#define LC2D3S2                       4166
#define CLC2SEL2_D3S2                 4167
#define LC2D3S3                       4168
#define CLC2SEL2_D3S3                 4169
#define LC2D3S4                       4170
#define CLC2SEL2_D3S4                 4171
#define LC2D3S5                       4172
#define CLC2SEL2_D3S5                 4173
#define CLC2SEL3                      4174
#define LC2D4S0                       4175
#define CLC2SEL3_D4S                  4176
#define CLC2SEL3_D4S0                 4177
#define LC2D4S                        4178
#define LC2D4S1                       4179
#define CLC2SEL3_D4S1                 4180
#define LC2D4S2                       4181
#define CLC2SEL3_D4S2                 4182
#define CLC2SEL3_D4S3                 4183
#define LC2D4S3                       4184
#define LC2D4S4                       4185
#define CLC2SEL3_D4S4                 4186
#define LC2D4S5                       4187
#define CLC2SEL3_D4S5                 4188
#define CLC2GLS0                      4189
#define LC2G1D1N                      4190
#define CLC2GLS0_D1N                  4191
#define CLC2GLS0_D1T                  4192
#define LC2G1D1T                      4193
#define LC2G1D2N                      4194
#define CLC2GLS0_D2N                  4195
#define CLC2GLS0_D2T                  4196
#define LC2G1D2T                      4197
#define LC2G1D3N                      4198
#define CLC2GLS0_D3N                  4199
#define CLC2GLS0_D3T                  4200
#define LC2G1D3T                      4201
#define LC2G1D4N                      4202
#define CLC2GLS0_D4N                  4203
#define CLC2GLS0_D4T                  4204
#define LC2G1D4T                      4205
#define CLC2GLS1                      4206
#define CLC2GLS1_D1N                  4207
#define LC2G2D1N                      4208
#define CLC2GLS1_D1T                  4209
#define LC2G2D1T                      4210
#define CLC2GLS1_D2N                  4211
#define LC2G2D2N                      4212
#define CLC2GLS1_D2T                  4213
#define LC2G2D2T                      4214
#define LC2G2D3N                      4215
#define CLC2GLS1_D3N                  4216
#define LC2G2D3T                      4217
#define CLC2GLS1_D3T                  4218
#define LC2G2D4N                      4219
#define CLC2GLS1_D4N                  4220
#define LC2G2D4T                      4221
#define CLC2GLS1_D4T                  4222
#define CLC2GLS2                      4223
#define LC2G3D1N                      4224
#define CLC2GLS2_D1N                  4225
#define CLC2GLS2_D1T                  4226
#define LC2G3D1T                      4227
#define CLC2GLS2_D2N                  4228
#define LC2G3D2N                      4229
#define LC2G3D2T                      4230
#define CLC2GLS2_D2T                  4231
#define CLC2GLS2_D3N                  4232
#define LC2G3D3N                      4233
#define CLC2GLS2_D3T                  4234
#define LC2G3D3T                      4235
#define CLC2GLS2_D4N                  4236
#define LC2G3D4N                      4237
#define LC2G3D4T                      4238
#define CLC2GLS2_D4T                  4239
#define CLC2GLS3                      4240
#define LC2G4D1N                      4241
#define CLC2GLS3_G4D1N                4242
#define CLC2GLS3_G4D1T                4243
#define LC2G4D1T                      4244
#define CLC2GLS3_G4D2N                4245
#define LC2G4D2N                      4246
#define LC2G4D2T                      4247
#define CLC2GLS3_G4D2T                4248
#define CLC2GLS3_G4D3N                4249
#define LC2G4D3N                      4250
#define CLC2GLS3_G4D3T                4251
#define LC2G4D3T                      4252
#define LC2G4D4N                      4253
#define CLC2GLS3_G4D4N                4254
#define CLC2GLS3_G4D4T                4255
#define LC2G4D4T                      4256
#define CLC3CON                       4257
#define LC3MODE0                      4258
#define CLC3CON_MODE0                 4259
#define CLC3CON_MODE                  4260
#define LC3MODE                       4261
#define LC3MODE1                      4262
#define CLC3CON_MODE1                 4263
#define LC3MODE2                      4264
#define CLC3CON_MODE2                 4265
#define LC3INTN                       4266
#define CLC3CON_INTN                  4267
#define CLC3CON_INTP                  4268
#define LC3INTP                       4269
#define CLC3CON_OUT                   4270
#define LC3OUT                        4271
#define LC3EN                         4272
#define CLC3CON_EN                    4273
#define CLC3POL                       4274
#define LC3G1POL                      4275
#define CLC3POL_G1POL                 4276
#define LC3G2POL                      4277
#define CLC3POL_G2POL                 4278
#define CLC3POL_G3POL                 4279
#define LC3G3POL                      4280
#define LC3G4POL                      4281
#define CLC3POL_G4POL                 4282
#define LC3POL                        4283
#define CLC3POL_POL                   4284
#define CLC3SEL0                      4285
#define CLC3SEL0_D1S0                 4286
#define LC3D1S0                       4287
#define CLC3SEL0_D1S                  4288
#define LC3D1S                        4289
#define LC3D1S1                       4290
#define CLC3SEL0_D1S1                 4291
#define LC3D1S2                       4292
#define CLC3SEL0_D1S2                 4293
#define LC3D1S3                       4294
#define CLC3SEL0_D1S3                 4295
#define LC3D1S4                       4296
#define CLC3SEL0_D1S4                 4297
#define LC3D1S5                       4298
#define CLC3SEL0_D1S5                 4299
#define CLC3SEL1                      4300
#define CLC3SEL1_D2S                  4301
#define CLC3SEL1_D2S0                 4302
#define LC3D2S                        4303
#define LC3D2S0                       4304
#define CLC3SEL1_D2S1                 4305
#define LC3D2S1                       4306
#define CLC3SEL1_D2S2                 4307
#define LC3D2S2                       4308
#define CLC3SEL1_D2S3                 4309
#define LC3D2S3                       4310
#define CLC3SEL1_D2S4                 4311
#define LC3D2S4                       4312
#define CLC3SEL1_D2S5                 4313
#define LC3D2S5                       4314
#define CLC3SEL2                      4315
#define LC3D3S                        4316
#define CLC3SEL2_D3S                  4317
#define LC3D3S0                       4318
#define CLC3SEL2_D3S0                 4319
#define LC3D3S1                       4320
#define CLC3SEL2_D3S1                 4321
#define LC3D3S2                       4322
#define CLC3SEL2_D3S2                 4323
#define LC3D3S3                       4324
#define CLC3SEL2_D3S3                 4325
#define CLC3SEL2_D3S4                 4326
#define LC3D3S4                       4327
#define CLC3SEL2_D3S5                 4328
#define LC3D3S5                       4329
#define CLC3SEL3                      4330
#define CLC3SEL3_D4S0                 4331
#define LC3D4S0                       4332
#define CLC3SEL3_D4S                  4333
#define LC3D4S                        4334
#define LC3D4S1                       4335
#define CLC3SEL3_D4S1                 4336
#define LC3D4S2                       4337
#define CLC3SEL3_D4S2                 4338
#define LC3D4S3                       4339
#define CLC3SEL3_D4S3                 4340
#define LC3D4S4                       4341
#define CLC3SEL3_D4S4                 4342
#define LC3D4S5                       4343
#define CLC3SEL3_D4S5                 4344
#define CLC3GLS0                      4345
#define CLC3GLS0_D1N                  4346
#define LC3G1D1N                      4347
#define LC3G1D1T                      4348
#define CLC3GLS0_D1T                  4349
#define LC3G1D2N                      4350
#define CLC3GLS0_D2N                  4351
#define CLC3GLS0_D2T                  4352
#define LC3G1D2T                      4353
#define CLC3GLS0_D3N                  4354
#define LC3G1D3N                      4355
#define LC3G1D3T                      4356
#define CLC3GLS0_D3T                  4357
#define CLC3GLS0_D4N                  4358
#define LC3G1D4N                      4359
#define CLC3GLS0_D4T                  4360
#define LC3G1D4T                      4361
#define CLC3GLS1                      4362
#define LC3G2D1N                      4363
#define CLC3GLS1_D1N                  4364
#define CLC3GLS1_D1T                  4365
#define LC3G2D1T                      4366
#define LC3G2D2N                      4367
#define CLC3GLS1_D2N                  4368
#define LC3G2D2T                      4369
#define CLC3GLS1_D2T                  4370
#define LC3G2D3N                      4371
#define CLC3GLS1_D3N                  4372
#define CLC3GLS1_D3T                  4373
#define LC3G2D3T                      4374
#define LC3G2D4N                      4375
#define CLC3GLS1_D4N                  4376
#define LC3G2D4T                      4377
#define CLC3GLS1_D4T                  4378
#define CLC3GLS2                      4379
#define LC3G3D1N                      4380
#define CLC3GLS2_D1N                  4381
#define LC3G3D1T                      4382
#define CLC3GLS2_D1T                  4383
#define CLC3GLS2_D2N                  4384
#define LC3G3D2N                      4385
#define CLC3GLS2_D2T                  4386
#define LC3G3D2T                      4387
#define CLC3GLS2_D3N                  4388
#define LC3G3D3N                      4389
#define LC3G3D3T                      4390
#define CLC3GLS2_D3T                  4391
#define CLC3GLS2_D4N                  4392
#define LC3G3D4N                      4393
#define CLC3GLS2_D4T                  4394
#define LC3G3D4T                      4395
#define CLC3GLS3                      4396
#define LC3G4D1N                      4397
#define CLC3GLS3_G4D1N                4398
#define LC3G4D1T                      4399
#define CLC3GLS3_G4D1T                4400
#define LC3G4D2N                      4401
#define CLC3GLS3_G4D2N                4402
#define CLC3GLS3_G4D2T                4403
#define LC3G4D2T                      4404
#define LC3G4D3N                      4405
#define CLC3GLS3_G4D3N                4406
#define CLC3GLS3_G4D3T                4407
#define LC3G4D3T                      4408
#define LC3G4D4N                      4409
#define CLC3GLS3_G4D4N                4410
#define LC3G4D4T                      4411
#define CLC3GLS3_G4D4T                4412
#define CLC4CON                       4413
#define LC4MODE                       4414
#define CLC4CON_MODE                  4415
#define LC4MODE0                      4416
#define CLC4CON_MODE0                 4417
#define LC4MODE1                      4418
#define CLC4CON_MODE1                 4419
#define LC4MODE2                      4420
#define CLC4CON_MODE2                 4421
#define LC4INTN                       4422
#define CLC4CON_INTN                  4423
#define CLC4CON_INTP                  4424
#define LC4INTP                       4425
#define CLC4CON_OUT                   4426
#define LC4OUT                        4427
#define CLC4CON_EN                    4428
#define LC4EN                         4429
#define CLC4POL                       4430
#define CLC4POL_G1POL                 4431
#define LC4G1POL                      4432
#define CLC4POL_G2POL                 4433
#define LC4G2POL                      4434
#define CLC4POL_G3POL                 4435
#define LC4G3POL                      4436
#define LC4G4POL                      4437
#define CLC4POL_G4POL                 4438
